# Pandas as pd

In [57]:
import numpy as np
import pandas as pd
index_data = ["11","12","13","14"]
s4 = pd.Series([200,195,np.nan,534], index = index_data)
s4

11    200.0
12    195.0
13      NaN
14    534.0
dtype: float64

In [58]:
s5 = pd.Series({
    "국어" : 100 ,
    "수학" : 95,
    "컴퓨터공학" : 5000,
    "기계공학" : 50
})
s5

국어        100
수학         95
컴퓨터공학    5000
기계공학       50
dtype: int64

In [59]:
a1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
# key : value = index : data 관계라 생각하면 이해하기 쉬울 듯
a1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [60]:
a1 = [[1,2,3],[4,5,6],[7,8,9]]

pd.DataFrame(a1) # 이런식으로 표현도 가능함

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [61]:
a1 = [[1,2,3],[4,5,6],[7,8,9]]
index_data = ["1월","2월","3월"]
column_data = ['A','B','C']
# pd.dataframe(a1,index = index_data, column = column_data)
pd.DataFrame(a1,index = index_data, columns = column_data) # 짜증나는 건 칼럼은 s 붙여야한다...

    A  B  C
1월  1  2  3
2월  4  5  6
3월  7  8  9

In [62]:
table_data = {
    "연도" : [2015,2016,2017,2017],
    "지사" : ['us','kr','kr','jp'],
    '고객수' : [200,300,200,400]
}
pd.DataFrame(table_data)

     연도  지사  고객수
0  2015  us  200
1  2016  kr  300
2  2017  kr  200
3  2017  jp  400

In [63]:
df = pd.DataFrame(table_data, columns = ['지사','고객수','연도'])
df
# 이런 형태로 순서를 바꿀 수 도 있음...

   지사  고객수    연도
0  us  200  2015
1  kr  300  2016
2  kr  200  2017
3  jp  400  2017

In [64]:
df.values # 안에들어있는 data 만 빼내기

array([['us', 200, 2015],
       ['kr', 300, 2016],
       ['kr', 200, 2017],
       ['jp', 400, 2017]], dtype=object)

In [65]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [66]:
df.columns

Index(['지사', '고객수', '연도'], dtype='object')

In [67]:
import random
a = [random.randrange(100,1000) for i in range(4)]
a 
# [467, 204, 822, 385]
# [107, 592, 186, 196]
# [989, 633, 288, 940]
# [647, 766, 834, 941]

[914, 481, 701, 209]

In [68]:
data = {
    '봄' : [467, 204, 822, 385],
    '여름' : [107, 592, 186, 196],
    '가을' : [989, 633, 288, 940],
    '겨울' : [647, 766, 834, 941]}
df = pd.DataFrame(data,index=[2020,2021,2022,2023])
# df[2024] = df.mean() 이거 열 추가 하는건 어떻게 해야하나...
df

        봄   여름   가을   겨울
2020  467  107  989  647
2021  204  592  633  766
2022  822  186  288  834
2023  385  196  940  941

In [69]:
df.mean() #

봄     469.50
여름    270.25
가을    712.50
겨울    797.00
dtype: float64

In [70]:
df.std()

봄     259.417938
여름    218.162592
가을    323.897618
겨울    123.242309
dtype: float64

In [71]:
df.mean(axis=1)
df["mean"] = df.mean(axis=1) # 오... 이렇게 하면 된다...
df 
# (467 + 107 + 989 + 647) // 4 = 552
# axis=1 이란, 행 별로 연산
# axis=0 또는 기입이 없다면, 열 별로 연산

        봄   여름   가을   겨울    mean
2020  467  107  989  647  552.50
2021  204  592  633  766  548.75
2022  822  186  288  834  532.50
2023  385  196  940  941  615.50

In [72]:
df["mean"] = df.mean(axis=0) # 이렇게 하면 아무것도 안들어가진다...
df

        봄   여름   가을   겨울  mean
2020  467  107  989  647   NaN
2021  204  592  633  766   NaN
2022  822  186  288  834   NaN
2023  385  196  940  941   NaN

In [73]:
df["std"]=df.std(axis=1)
df

        봄   여름   가을   겨울  mean         std
2020  467  107  989  647   NaN  367.533672
2021  204  592  633  766   NaN  241.535884
2022  822  186  288  834   NaN  343.780453
2023  385  196  940  941   NaN  383.127916

In [74]:
df['var'] = df.var(axis=1)
df

        봄   여름   가을   겨울  mean         std            var
2020  467  107  989  647   NaN  367.533672  108153.258504
2021  204  592  633  766   NaN  241.535884   62630.790095
2022  822  186  288  834   NaN  343.780453   95761.763469
2023  385  196  940  941   NaN  383.127916  120889.607087

In [75]:
# 사실 이렇게 하는거 말고 한번에 구하는 방법도 있음
df.describe()

,봄,여름,가을,겨울,mean,std,var
count,4.000000,4.000000,4.000000,4.000000,0.0,4.000000,4.000000
mean,469.500000,270.250000,712.500000,797.000000,NaN,333.994481,96858.854789
std,259.417938,218.162592,323.897618,123.242309,NaN,63.726837,25018.690569
min,204.000000,107.000000,288.000000,647.000000,NaN,241.535884,62630.790095
25%,339.750000,166.250000,546.750000,736.250000,NaN,318.219311,87479.020126
50%,426.000000,191.000000,786.500000,800.000000,NaN,355.657063,101957.510987
75%,555.750000,295.000000,952.250000,860.750000,NaN,371.432233,111337.345650
max,822.000000,592.000000,989.000000,941.000000,NaN,383.127916,120889.607087

In [76]:
a = [random.randrange(1000,100000) for i in range(random.randrange(5,7))]
a

[91268, 43389, 54332, 60263, 31438, 66911]

In [77]:
data = {'경부선' : [1828, 61263, 22654, 58654, 7550, 23406],
        '호남선' : [93501, 56929, 74276, 6034, 92224, np.nan],
        '경전선' : [48332, 60079, 96481, 76922, 55066, 48940],
        '전라선' : [78650, 24573, 51472, 24832, 41294,np.nan],
        '동해선' : [34817, 35478, 4024, 67017, 24604, 31048]}
KTX_data = ['경부선','호남선','경전선','전라선','동해선']
index_data = ['2015','2016','2017','2018','2019','2020']

df_KTX = pd.DataFrame(data,index = index_data, columns = KTX_data)
df_KTX

        경부선      호남선    경전선      전라선    동해선
2015   1828  93501.0  48332  78650.0  34817
2016  61263  56929.0  60079  24573.0  35478
2017  22654  74276.0  96481  51472.0   4024
2018  58654   6034.0  76922  24832.0  67017
2019   7550  92224.0  55066  41294.0  24604
2020  23406      NaN  48940      NaN  31048

In [78]:
df_KTX.index

Index(['2015', '2016', '2017', '2018', '2019', '2020'], dtype='object')

In [79]:
df_KTX.values

array([[ 1828., 93501., 48332., 78650., 34817.],
       [61263., 56929., 60079., 24573., 35478.],
       [22654., 74276., 96481., 51472.,  4024.],
       [58654.,  6034., 76922., 24832., 67017.],
       [ 7550., 92224., 55066., 41294., 24604.],
       [23406.,    nan, 48940.,    nan, 31048.]])

In [80]:
df_KTX.columns

Index(['경부선', '호남선', '경전선', '전라선', '동해선'], dtype='object')

In [81]:
### df = df_KTX
df.head(3)

        봄   여름   가을   겨울  mean         std            var
2020  467  107  989  647   NaN  367.533672  108153.258504
2021  204  592  633  766   NaN  241.535884   62630.790095
2022  822  186  288  834   NaN  343.780453   95761.763469

In [82]:
df.tail(2)

        봄   여름   가을   겨울  mean         std            var
2022  822  186  288  834   NaN  343.780453   95761.763469
2023  385  196  940  941   NaN  383.127916  120889.607087

In [83]:
df[1:] # df[1]은 실행 안된다... 왜냐하면, 1만 넣었을 때 key처럼 인식하는 것 같다...

        봄   여름   가을   겨울  mean         std            var
2021  204  592  633  766   NaN  241.535884   62630.790095
2022  822  186  288  834   NaN  343.780453   95761.763469
2023  385  196  940  941   NaN  383.127916  120889.607087

In [84]:
df[1:2] #df[1]은 안되는데, 이렇게하면 df[1] 의도와 같은 결과가 나옴

        봄   여름   가을   겨울  mean         std           var
2021  204  592  633  766   NaN  241.535884  62630.790095

In [85]:
df[0:1] # df[0]

        봄   여름   가을   겨울  mean         std            var
2020  467  107  989  647   NaN  367.533672  108153.258504

# 내가 진짜 찾고 싶었던 기능
### loc

In [86]:
df.loc[2015]  # 인덱스 별로 출력

KeyError: 2015

In [ ]:
# df.loc['경부선'] # 이렇게말고
df['경부선'] # 열의 칼럼을 통한 출력

In [ ]:
df.loc[2016:2017] # 이렇게하면 인덱스 슬라이싱이 가능하다~~~

In [ ]:
df = df_KTX
df['호남선']['2013':'2017'] # 넘파이 할때 처럼 이런 것도 된다...

In [ ]:
df.loc['2015','호남선'] # 하나씩 빼볼때

In [ ]:
df['호남선']['2015'] # 위와 같음

In [ ]:
df['호남선'][0] # 곧 없어질 명령어라는 경고문 뜨는 건가...

In [ ]:
df['호남선'].loc['2015'] # 이건 왜되는 거임ㅋㅋㅋㅋ

In [ ]:
# 전치 구하기
df.T

In [ ]:
df

In [ ]:
df['호남선','동해선','전라선','경전선','경부선'] # 이건 안된다..

In [ ]:
df[['호남선','동해선','전라선','경전선','경부선']] # 칼럼 순서를 바꾸고 싶을 때..

In [ ]:
df[['2016','2015','2018']] # 이건 뭘해도 안됨... 열의 칼럼 명으로 바꾸는 것 만 가능하다...

# 데이터 통합하기

In [107]:
data1 = {
    'class1' : [1,2,3,4],
    'class2' : [5,6,7,8]}

df1 = pd.DataFrame(data1)
df1

   class1  class2
0       1       5
1       2       6
2       3       7
3       4       8

In [108]:
data2 = {
    'class1' : [9,10],
    'class2' : [1,-3]}
df2 = pd.DataFrame(data2)
df2

   class1  class2
0       9       1
1      10      -3

In [109]:
import numpy as np

# df1 = df1.append(df2) # 동작안함...
# df1

In [101]:
data3 = {
    'class3' : [55,34]}
df3 = pd.DataFrame(data3)
df3

   class3
0      55
1      34

In [115]:
df1.join(df3) # 혹시나 같은 칼럼명이 있으면 실행 자체가 안된다... 열추가 시에만 사용할 것
# 빈부분은 NaN으로 알아서 채워진다..

   class1  class2  class3
0       1       5    55.0
1       2       6    34.0
2       3       7     NaN
3       4       8     NaN

In [116]:
df4 = pd.DataFrame({'class4' : [4,6,3,5,6]}) 
df1.join(df4) # 초과한 행은 알아서 잘려나간다...

   class1  class2  class4
0       1       5       4
1       2       6       6
2       3       7       3
3       4       8       5

## 특정 열을 기준으로 통합하기, merge

In [134]:
df1 = pd.DataFrame({
    '판매월' : [4,5,6,7],
    '제품A' : [40,50,70,30],
    '제품B' : [50,55,45,40]
})
df2 = pd.DataFrame({
    '판매월' : [4,5,6,7],
    '제품C' : [41,59,71,20],
    '제품D' : [30,23,44,90]
})
df1

   판매월  제품A  제품B
0    4   40   50
1    5   50   55
2    6   70   45
3    7   30   40

In [126]:
df1.merge(df2)

   판매월  제품A  제품B  제품C  제품D
0    4   40   50   41   30
1    5   50   55   59   23
2    6   70   45   71   44
3    7   30   40   20   90

In [127]:
df1 = pd.DataFrame({
    '판매월' : [4,5,6,7],
    '제품A' : [40,50,70,30],
    '제품B' : [50,55,45,40]
})
df2 = pd.DataFrame({
    '판매월' : [4,5,6,0], # 7을 0 으로 바꾼경우
    '제품C' : [41,59,71,20],
    '제품D' : [30,23,44,90]
})

In [129]:
df1.merge(df2) # 서로 겹치지 않는 판매월인 7,0 은 자동으로 잘려서 나온다...

   판매월  제품A  제품B  제품C  제품D
0    4   40   50   41   30
1    5   50   55   59   23
2    6   70   45   71   44

In [135]:
df2.merge(df1)

   판매월  제품C  제품D  제품A  제품B
0    4   41   30   40   50
1    5   59   23   50   55
2    6   71   44   70   45
3    7   20   90   30   40

### 일부만 공통된 값을 갖는 경우에는??

In [136]:
df_left = pd.DataFrame({'key':['A','B','C'], 'left' : [1,2,3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [138]:
df_right = pd.DataFrame({'key' : ['A','B','D'], 'right' : [4,5,6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [140]:
df_left.merge(df_right) # 아래가 잘려서 나옴

  key  left  right
0   A     1      4
1   B     2      5

In [142]:
df_left.merge(df_right, how = 'left',on = 'key') # how에 들어가는 것의 칼럼 기준이 됨

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [144]:
df_left.merge(df_right, how='right',on='key') # 이번에는 right 칼럼이 기준이 됨

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [146]:
df_left.merge(df_right, how ='outer',on ='key') # 합집합 느낌인 것 같다..

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [148]:
df_left.merge(df_right, how = 'inner',on='key') # 사실 merge할때 how를 안쓰면 나오는 default 값과 같다...

  key  left  right
0   A     1      4
1   B     2      5

# 책에 나오진 않지만 알고 있으면 유용한 concat

In [156]:
df1 = pd.DataFrame({
    '판매월' : [4,5,6,7],
    '제품A' : [40,50,70,30],
    '제품B' : [50,55,45,40]
})
df2 = pd.DataFrame({
    '판매월' : [4,5,6,0], # 7을 0 으로 바꾼경우
    '제품C' : [41,59,71,20],
    '제품D' : [30,23,44,90]
})
pd.concat([df1,df2]) # 합치기...

   판매월   제품A   제품B   제품C   제품D
0    4  40.0  50.0   NaN   NaN
1    5  50.0  55.0   NaN   NaN
2    6  70.0  45.0   NaN   NaN
3    7  30.0  40.0   NaN   NaN
0    4   NaN   NaN  41.0  30.0
1    5   NaN   NaN  59.0  23.0
2    6   NaN   NaN  71.0  44.0
3    0   NaN   NaN  20.0  90.0

In [158]:
df1 = pd.DataFrame({
    '판매월' : [4,5,6,7],
    '제품A' : [40,50,70,30],
    '제품B' : [50,55,45,40]
})
df2 = pd.DataFrame({
    '판매월' : [4,5,6,0], # 7을 0 으로 바꾼경우
    '제품A' : [41,59,71,20],
    '제품B' : [30,23,44,90]
})
pd.concat([df1,df2]) # 합치기...

   판매월  제품A  제품B
0    4   40   50
1    5   50   55
2    6   70   45
3    7   30   40
0    4   41   30
1    5   59   23
2    6   71   44
3    0   20   90

In [175]:
index_data = [1,2,3,4]
df1 = pd.DataFrame(data = [4,3,6,3],index = index_data, columns=["집가고싶다..1"])
df2 = pd.DataFrame(data = [6,3,6,7], index = index_data, columns=["집가고싶다..2"])
df1.merge(df2)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [177]:
df1.join(df2)

   집가고싶다..1  집가고싶다..2
1         4         6
2         3         3
3         6         6
4         3         7

In [179]:
pd.concat([df1,df2])

   집가고싶다..1  집가고싶다..2
1       4.0       NaN
2       3.0       NaN
3       6.0       NaN
4       3.0       NaN
1       NaN       6.0
2       NaN       3.0
3       NaN       6.0
4       NaN       7.0

# 아무튼
### 데이터 통합/합치기에 대해서 concat, join, merge에 대해 배웠다...